{
  "metadata": {
    "total_size": 5683266692
  },
  "weight_map": {
    "esm.contact_head.regression.bias": "model-00002-of-00002.safetensors",
    "esm.contact_head.regression.weight": "model-00002-of-00002.safetensors",
    "esm.embeddings.position_embeddings.weight": "model-00001-of-00002.safetensors",
    "esm.embeddings.word_embeddings.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.emb_layer_norm_after.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.emb_layer_norm_after.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.0.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.0.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.1.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.10.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.11.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.12.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.13.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.14.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.15.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.16.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.17.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.18.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.19.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.2.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.20.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.21.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.22.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.23.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.24.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.25.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.26.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.27.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.28.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.29.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.3.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.30.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.31.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.31.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.31.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.31.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.key.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.key.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.query.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.query.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.rotary_embeddings.inv_freq": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.value.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.attention.self.value.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.intermediate.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.intermediate.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.32.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.key.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.key.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.query.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.query.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.rotary_embeddings.inv_freq": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.value.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.attention.self.value.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.intermediate.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.intermediate.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.33.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.key.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.key.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.query.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.query.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.rotary_embeddings.inv_freq": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.value.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.attention.self.value.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.intermediate.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.intermediate.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.34.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.LayerNorm.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.LayerNorm.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.key.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.key.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.query.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.query.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.rotary_embeddings.inv_freq": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.value.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.attention.self.value.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.intermediate.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.intermediate.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.output.dense.bias": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.35.output.dense.weight": "model-00002-of-00002.safetensors",
    "esm.encoder.layer.4.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.4.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.query.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.rotary_embeddings.inv_freq": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.value.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.attention.self.value.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.intermediate.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.intermediate.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.5.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.LayerNorm.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.LayerNorm.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.output.dense.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.output.dense.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.self.key.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.self.key.weight": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.self.query.bias": "model-00001-of-00002.safetensors",
    "esm.encoder.layer.6.attention.self.query.weight": "model-00001-of-00002.safetensors",
